In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#membaca data dalam format file csv
df = pd.read_csv("/content/mtcars.csv")

In [ ]:
df.head() #menampilkan 5 baris pertama data

               model   mpg  cyl   disp   hp  ...   qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110  ...  16.46   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110  ...  17.02   0   1     4     4
2         Datsun 710  22.8    4  108.0   93  ...  18.61   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110  ...  19.44   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175  ...  17.02   0   0     3     2

[5 rows x 12 columns]

In [ ]:
df.isnull().sum() #mengetahui jumlah none value pada tabel

model    0
mpg      0
cyl      0
disp     0
hp       0
drat     0
wt       0
qsec     0
vs       0
am       0
gear     0
carb     0
dtype: int64

In [ ]:
#pada data ini tidak terdapat none value seperti pada informasi diatas
import numpy as np

# Membuat mapping dict
class_mapping = {label: idx for idx, label in enumerate(np.unique(df['model']))}
class_mapping

{'AMC Javelin': 0,
 'Cadillac Fleetwood': 1,
 'Camaro Z28': 2,
 'Chrysler Imperial': 3,
 'Datsun 710': 4,
 'Dodge Challenger': 5,
 'Duster 360': 6,
 'Ferrari Dino': 7,
 'Fiat 128': 8,
 'Fiat X1-9': 9,
 'Ford Pantera L': 10,
 'Honda Civic': 11,
 'Hornet 4 Drive': 12,
 'Hornet Sportabout': 13,
 'Lincoln Continental': 14,
 'Lotus Europa': 15,
 'Maserati Bora': 16,
 'Mazda RX4': 17,
 'Mazda RX4 Wag': 18,
 'Merc 230': 19,
 'Merc 240D': 20,
 'Merc 280': 21,
 'Merc 280C': 22,
 'Merc 450SE': 23,
 'Merc 450SL': 24,
 'Merc 450SLC': 25,
 'Pontiac Firebird': 26,
 'Porsche 914-2': 27,
 'Toyota Corolla': 28,
 'Toyota Corona': 29,
 'Valiant': 30,
 'Volvo 142E': 31}

In [ ]:
print('normalized:', (df["cyl"] - df["cyl"].min()) / (df["cyl"].max() - df["cyl"].min()))

normalized: 0     0.5
1     0.5
2     0.0
3     0.5
4     1.0
5     0.5
6     1.0
7     0.0
8     0.0
9     0.5
10    0.5
11    1.0
12    1.0
13    1.0
14    1.0
15    1.0
16    1.0
17    0.0
18    0.0
19    0.0
20    0.0
21    1.0
22    1.0
23    1.0
24    1.0
25    0.0
26    0.0
27    0.0
28    1.0
29    0.5
30    1.0
31    0.0
Name: cyl, dtype: float64

In [ ]:
print('normalized:', (df["disp"] - df["disp"].min()) / (df["disp"].max() - df["disp"].min()))

normalized: 0     0.221751
1     0.221751
2     0.092043
3     0.466201
4     0.720629
5     0.383886
6     0.720629
7     0.188576
8     0.173859
9     0.240708
10    0.240708
11    0.510601
12    0.510601
13    0.510601
14    1.000000
15    0.970067
16    0.920180
17    0.018957
18    0.011474
19    0.000000
20    0.122225
21    0.615864
22    0.580943
23    0.695685
24    0.820404
25    0.019706
26    0.122724
27    0.059865
28    0.698179
29    0.184335
30    0.573460
31    0.124470
Name: disp, dtype: float64

In [ ]:
df.info() #menampilkan info dari masing-masing kolom

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   model   32 non-null     object
 1   mpg     32 non-null     float64
 2   cyl     32 non-null     int64
 3   disp    32 non-null     float64
 4   hp      32 non-null     int64
 5   drat    32 non-null     float64
 6   wt      32 non-null     float64
 7   qsec    32 non-null     float64
 8   vs      32 non-null     int64
 9   am      32 non-null     int64
 10  gear    32 non-null     int64
 11  carb    32 non-null     int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [ ]:
df.describe()

             mpg        cyl        disp  ...         am       gear     carb
count  32.000000  32.000000   32.000000  ...  32.000000  32.000000  32.0000
mean   20.090625   6.187500  230.721875  ...   0.406250   3.687500   2.8125
std     6.026948   1.785922  123.938694  ...   0.498991   0.737804   1.6152
min    10.400000   4.000000   71.100000  ...   0.000000   3.000000   1.0000
25%    15.425000   4.000000  120.825000  ...   0.000000   3.000000   2.0000
50%    19.200000   6.000000  196.300000  ...   0.000000   4.000000   2.0000
75%    22.800000   8.000000  326.000000  ...   1.000000   4.000000   4.0000
max    33.900000   8.000000  472.000000  ...   1.000000   5.000000   8.0000

[8 rows x 11 columns]

In [ ]:
df[["cyl", "disp"]].groupby(["cyl"]).describe().unstack()